Revit 2027 API
ExternalResourceSubFolder.IconPath Property
 The path of the resource icon.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string IconPath { get; set; }
Public Property IconPath As String
	Get
	Set
public:
property String^ IconPath {
	String^ get ();
	void set (String^ value);
}
member IconPath : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExternalResourceSubFolder Class
Autodesk.Revit.DB Namespace